# ServerPath Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ModelPath..::..ServerPath Property
ModelPath Class See Also
---
Whether this path is a server path (as opposed to a file path or cloud path)
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool ServerPath { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ServerPath As Boolean
	Get
```

Visual C++
---
```text
public:
property bool ServerPath {
	bool get ();
}
```

# See Also
ModelPath Class
Autodesk.Revit.DB Namespace